brew "zsh"
brew "git"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "jq"
brew "zoxide"       # optional: smarter cd
brew "node"
brew "neovim"
brew "uv"        # Python package installer (for MCP servers)
brew "go"        # For GitHub MCP server
brew "jenv"       # Java version manager
cask "temurin@17"   # Eclipse Temurin JDK 17 (LTS)
cask "temurin@21"   # Eclipse Temurin JDK 21 (LTS)
cask "temurin"      # Eclipse Temurin JDK 24 (latest)
cask "claude-code"
cask "font-meslo-lg-nerd-font"  # still works as a normal cask

