brew "zsh"
brew "git"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "jq"
brew "zoxide"       # optional: smarter cd
brew "node"
brew "helix"          # Modern modal editor, batteries-included
brew "zellij"         # Terminal multiplexer with modern defaults
brew "lazygit"        # Git TUI for reviewing changes
brew "yazi"           # Terminal file manager with preview
brew "git-delta"      # Better git diffs
brew "uv"        # Python package installer (for MCP servers)
brew "go"        # For GitHub MCP server
brew "jenv"       # Java version manager
brew "mvn"

# Language Servers for Helix
brew "pyright"                    # Python LSP
brew "ruff"                       # Python linter/formatter
brew "typescript-language-server" # TypeScript/JavaScript LSP
brew "prettier"                   # JS/TS/JSON formatter
brew "jdtls"                      # Java LSP (Eclipse JDT)
cask "temurin@17"   # Eclipse Temurin JDK 17 (LTS)
cask "temurin@21"   # Eclipse Temurin JDK 21 (LTS)
cask "temurin"      # Eclipse Temurin JDK 24 (latest)
cask "claude-code"
cask "font-meslo-lg-nerd-font"  # still works as a normal cask
